base/Documents/бит_му_НачислениеАмортизацииОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_НачислениеАмортизацииОС</Name>
			<Comment>(БИТ МУ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>InformationRegister.бит_му_ПараметрыОС</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>InformationRegister.бит_му_СобытияОС</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыОперацийНачислениеАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>МОЛ, по которому оформлен документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение, по которому оформлен документ</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ПодразделениеМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
					<Comment>Основные средства</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Comment>Основное средство</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодНачисленияАмортизации</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_му_МетодыНачисленияАмортизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНачисленияАмортизации</Name>
							<Comment>Счет начисления амортизации</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАмортизации</Name>
							<Comment>Сумма амортизации (МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимость</Name>
							<Comment>Первоначальная стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленнаяАмортизация</Name>
							<Comment>Начисленная амортизация</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбесценения</Name>
							<Comment>Сумма обесценения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛиквидационнаяСтоимость</Name>
							<Comment>Ликвидационная стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентУскорения</Name>
							<Comment>Коэффициент ускорения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродукцииТекущий</Name>
							<Comment>Объем продукции (работ) в натуральных ед.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродукцииОстаточный</Name>
							<Comment>Объем продукции (работ) в натуральных ед. остаточный</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаточныйСрокАмортизации</Name>
							<Comment>Остаточный срок амортизации</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтраженияРасходовПоАмортизации</Name>
							<Comment>Способ отражения расходов по амортизации</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_му_СпособыОтраженияРасходовПоАмортизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/InformationRegisters/бит_му_СобытияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_му_СобытияОС</Name>
			<Comment>(БИТ МУ)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Comment>Основное средство</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Comment>Событие</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_СобытияОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Enums/бит_му_ВидыКлассовОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_ВидыКлассовОС</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновныеСредства</Name>
					<Comment>Основные средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвестиционнаяСобственность</Name>
					<Comment>Инвестиционная собственность</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_му_РежимыПодбораВНА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_РежимыПодбораВНА</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчетуОС</Name>
					<Comment>Принятие к учету ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводНачальныхОстатковОС</Name>
					<Comment>Ввод начальных остатков ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеОС</Name>
					<Comment>Перемещение ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодернизацияОС</Name>
					<Comment>Модернизация ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеАмортизацииОС</Name>
					<Comment>Начисление амортизации ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеАмортизацииНМА</Name>
					<Comment>Начисление амортизации НМА</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыработкаОС</Name>
					<Comment>Выработка ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбесценениеОС</Name>
					<Comment>Обесценение ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаОС</Name>
					<Comment>Переоценка ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеОС</Name>
					<Comment>Выбытие ОС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчетуНМА</Name>
					<Comment>Принятие к учету НМА</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеНМА</Name>
					<Comment>Выбытие НМА</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыработкаНМА</Name>
					<Comment>Выработка НМА</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаНМА</Name>
					<Comment>Переоценка НМА</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбесценениеНМА</Name>
					<Comment>Обесценение НМА</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводОСВСоставИнвестиционнойСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчетуОСПоОстаткам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчетуНМАПоОстаткам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_му_СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_СостоянияОС</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятоКУчету</Name>
					<Comment>Принято к учету</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
					<Comment>Снято с учета</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_му_МетодыНачисленияАмортизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_МетодыНачисленияАмортизации</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Линейный</Name>
					<Comment>Линейный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшаемогоОстатка</Name>
					<Comment>Уменьшаемого остатка</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производственный</Name>
					<Comment>Производственный</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_му_СобытияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_СобытияОС</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчету</Name>
					<Comment>Принятие к учету</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеРезерва</Name>
					<Comment>Формирование резерва</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбесценения</Name>
					<Comment>Возврат обесценения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Модернизация</Name>
					<Comment>Модернизация</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дооценка</Name>
					<Comment>Дооценка ОС при переоценки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уценка</Name>
					<Comment>Уценка ОС при переоценки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеАмортизации</Name>
					<Comment>Начисление амортизации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеклассификацияЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевод</Name>
					<Comment>Перевод в предназначенные для продажи</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Продажа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выбытие</Name>
					<Comment>Выбытие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводВСоставИнвестиционнойСобственности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_му_НачислениеАмортизацииОС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мВалютаМеждУчета Экспорт; // Хранит валюту международного учета

Перем мКоличествоСубконтоМУ Экспорт; // Хранит количество субконто международного учета в документа.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Переменная, хранящее значение структуры шапки документа.
	Перем СтруктураШапкиДокумента;

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект, Ложь) Тогда
		Возврат
	КонецЕсли;
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Получим курсы валют, неоходимые для выполнения пересчетов
	ВидыКурсов = Новый Структура("Упр,Регл,МУ,Документ");
	СтруктураКурсыВалют = бит_му_ОбщегоНазначения.КурсыВалютДокументаМУ(ЭтотОбъект, СтруктураШапкиДокумента.Дата, ВидыКурсов);
	
	СтрКурсов = СтруктураКурсыВалют.МУ;
	мВалютаМеждУчета = СтрКурсов.Валюта;
	Если НЕ ЗначениеЗаполнено(мВалютаМеждУчета) Тогда
		
		ТекстСообщения = НСтр("ru = 'Для организации ""%1"" не указана валюта международного учета.'; 
		                      |en = 'The organization ""%1"" does not have an international accounting currency.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения,СтруктураШапкиДокумента.Организация);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);
	                               
	КонецЕсли; 
	
	// Поиск уже выполненных начислений амортизации.
	НайтиЗадвоенныеНачисления(Отказ,Заголовок);
	
	СтруктураТаблиц = ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента);
	
	ПроверитьЗаполнениеТаблицДокумента(СтруктураТаблиц,СтруктураШапкиДокумента,Отказ,Заголовок);
	
	// Получим исторические(на дату принятия к учету) курсы валют по каждому НМА.
	МассивОС = ОсновныеСредства.ВыгрузитьКолонку("ОсновноеСредство");
	МассивОС = бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивОС);
	ИсторическиеКурсы = ИсторическиеКурсыВалют(СтруктураШапкиДокумента, МассивОС, КонецМесяца(СтруктураШапкиДокумента.Дата), СтруктураКурсыВалют);

	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента,СтруктураТаблиц,ИсторическиеКурсы, Отказ, Заголовок);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	
		
КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьШапкуДокумента();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЗаполнитьШапкуДокумента(ОбъектКопирования);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СтруктураНеДублирующихсяПолей = Новый Структура;
	СтруктураНеДублирующихсяПолей.Вставить("ОсновноеСредство");
	
	// Проверим наличие дублей в табличной части "ОсновныеСредства".
	бит_ОбщегоНазначения.ПроверитьДублированиеЗначенийВТабличнойЧасти(ЭтотОбъект
																	 ,"ОсновныеСредства"
																	 ,СтруктураНеДублирующихсяПолей
																	 ,Отказ);
																	 
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура очищает недоступные параметры ОС в зависимости от метода начисления амортизации.
// 
// Параметры:
//  ТекущаяСтрока - СтрокаТабличнойЧасти.ОсновныеСредства.
// 
Процедура ОчиститьНедоступныеПараметрыОС(ТекущаяСтрока) Экспорт
	
	// Получим массив недоступных параметров.
	МассивНедоступныхПараметров = СформироватьМассивНедоступныхПараметров(ТекущаяСтрока);
	
	Для Каждого ТекИмяПараметра Из МассивНедоступныхПараметров Цикл
		ТекущаяСтрока[ТекИмяПараметра] = Неопределено;
	КонецЦикла;
	
КонецПроцедуры // ОчиститьНедоступныеПараметрыОС()

// Процедура обрабатывает изменение валюты документа.
// 
Процедура ИзменениеВалютыМодуль() Экспорт

	СтруктураКурса = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	
	КурсДокумента      = СтруктураКурса.Курс;
	КратностьДокумента = СтруктураКурса.Кратность;

КонецПроцедуры // ИзменениеВалютыМодуль()

// Процедура выполняет валютные пересчеты из валюты МУ в валюту документа.
// 
// Параметры:
//  ПараметрыОС
// 
Процедура ВыполнитьВалютныеПересчетыИзВалютыМУВВалютуДокументаМодуль(ПараметрыОС) Экспорт
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ВидыКурсов = Новый Структура("МУ, Документ");	
	СтруктураКурсыВалют = бит_му_ОбщегоНазначения.КурсыВалютДокументаМУ(ЭтотОбъект, СтруктураШапкиДокумента.Дата, ВидыКурсов);
	
	МассивСуммДляПересчета = Новый Массив;
	МассивСуммДляПересчета.Добавить("СуммаАмортизации");
	МассивСуммДляПересчета.Добавить("ПервоначальнаяСтоимость");
	МассивСуммДляПересчета.Добавить("НачисленнаяАмортизация");
	МассивСуммДляПересчета.Добавить("СуммаОбесценения");
	МассивСуммДляПересчета.Добавить("ЛиквидационнаяСтоимость");
	
	МассивОС = Новый Массив; 
	Для каждого КлючИЗначение Из ПараметрыОС Цикл
		МассивОС.Добавить(КлючИЗначение.Ключ);
	КонецЦикла; 
	ТаблицаДанных = ПодготовитьТаблицуДатПринятияОС(МассивОС);
	ТаблицаПериодов = ТаблицаДанных.Скопировать(, "Период");
	Курсы = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(ТаблицаПериодов, СтруктураКурсыВалют);
	
	СоответствиеКурсовИОС = Новый Соответствие;
	
	Для каждого Строка Из ТаблицаДанных Цикл
		СоответствиеКурсовИОС.Вставить(Строка.ОсновноеСредство, Курсы[Строка.Период])
	КонецЦикла; 

	Для Каждого КлючИЗначение Из ПараметрыОС Цикл
		
		КурсыМУ 	  = СоответствиеКурсовИОС[КлючИЗначение.Ключ].МУ;
		КурсыДокумент = СоответствиеКурсовИОС[КлючИЗначение.Ключ].Документ;
		
		ВНА = КлючИЗначение.Значение;
		
		Для каждого ИмяСуммы Из МассивСуммДляПересчета Цикл
			
			
			ВНА[ИмяСуммы] = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(ВНА[ИмяСуммы]
							,КурсыМУ.Валюта
							,КурсыДокумент.Валюта
							,КурсыМУ.Курс
							,КурсыДокумент.Курс
							,КурсыМУ.Кратность
							,КурсыДокумент.Кратность);
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьВалютныеПересчетыИзВалютыМУВВалютуДокументаМодуль()

// Функция получает параметры, передаваемые в обработку подбора ОС.
//
Функция ЗаполнитьПараметрыПодбора() Экспорт
	
	Если ВидОперации = Перечисления.бит_му_ВидыОперацийНачислениеАмортизацииОС.ОсновныеСредства Тогда
		ВидКласса = Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства;
	Иначе
		ВидКласса = Перечисления.бит_му_ВидыКлассовОС.ИнвестиционнаяСобственность;
	КонецЕсли;
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыПодбора.Вставить("Организация"		  , Организация);                             
	ПараметрыПодбора.Вставить("Режим"			  , Перечисления.бит_му_РежимыПодбораВНА.НачислениеАмортизацииОС);
	ПараметрыПодбора.Вставить("ДатаОкончания"	  , КонецМесяца(Дата));
	ПараметрыПодбора.Вставить("МОЛ"				  , МОЛ);
	ПараметрыПодбора.Вставить("Местонахождение"	  , Подразделение);
	ПараметрыПодбора.Вставить("ВидКласса"		  , ВидКласса);	

	Возврат ПараметрыПодбора;
	
КонецФункции // ЗаполнитьПараметрыПодбора()

// Процедура заполняет табличную часть "ОсновныеСредства".
// 
// Параметры:
//  ВыбранноеЗначение - Структура.
//  ЭтоНовыйДокумент  - Булево.
// 
Процедура ЗаполнитьТчОсновныеСредстваПоДаннымПодбора(ВыбранноеЗначение, ЭтоНовыйДокумент = Истина) Экспорт
	
	ОписаниеТаблицы = ВыбранноеЗначение.Данные;
	ТаблицаДанных = бит_ОбщегоНазначения.РаспаковатьТаблицуИзМассива(ОписаниеТаблицы.ПереченьОбъектов, ОписаниеТаблицы.ПереченьОбъектов_Колонки);
	
	// Получаем параметры и рассчитываем амортизацию.
	МассивОС    = ТаблицаДанных.ВыгрузитьКолонку("ВНА");
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивОС);
	
	МоментВремени = ?(ЭтоНовыйДокумент, КонецДня(Дата), Ссылка.МоментВремени());
	ПараметрыОС = бит_му_ВНА.ВыполнитьРасчетАмортизации(МассивОС, Организация, МоментВремени, Истина);	
	
	ВыполнитьВалютныеПересчетыИзВалютыМУВВалютуДокументаМодуль(ПараметрыОС);
	
	Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ОсновноеСредство", СтрокаТаблицы.ВНА);
		
		МассивСтрок = ОсновныеСредства.НайтиСтроки(СтруктураОтбора);
		
		Если МассивСтрок.Количество() = 0 Тогда
			НайденнаяСтрока = Неопределено;
		Иначе
			НайденнаяСтрока = МассивСтрок[0];
		КонецЕсли;
		
		Если НайденнаяСтрока = Неопределено Тогда
			
			// Результат расчета амортизации.
			СтрокаПараметров = ПараметрыОС[СтрокаТаблицы.ВНА];
			
			// Новая строка 
			НоваяСтрока = ОсновныеСредства.Добавить();
			НоваяСтрока.ОсновноеСредство = СтрокаТаблицы.ВНА;
			
			Если СтрокаПараметров <> Неопределено Тогда				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПараметров);				
			КонецЕсли; 
			
		Иначе
			
			ТекстСообщения = НСтр("ru = 'Основное средство ""%1"" инв. №%2 уже подобрано в строке №%3.'; 
			                      |en = 'Fixed asset ""%1"" inv. №%2 is already matched in line №%3.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаТаблицы.ВНА, СтрокаТаблицы.ИнвентарныйНомер, НайденнаяСтрока.НомерСтроки);									   
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли; 
		
	КонецЦикла; // По строкам таблицы данных		

КонецПроцедуры // ЗаполнитьТчОсновныеСредстваПоДаннымПодбора()

// Процедура заполняет документ.
// 
// Параметры:
//  СтруктураЗаполнения - Структура.
//
Процедура ЗаполнитьДокумент(СтруктураЗаполнения) Экспорт

	// Обязательные для заполнения поля: Дата, Организация, ВидОперации
	Для каждого КлЗнч Из СтруктураЗаполнения Цикл
		ИмяРеквизита = КлЗнч.Ключ;
		Если ИмяРеквизита = "Дата" ИЛИ Метаданные().Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
			ЭтотОбъект[ИмяРеквизита] = КлЗнч.Значение;
		КонецЕсли; 	
	КонецЦикла;
	
	// Получим валюту международного учета.
	ВалютаДокумента = бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(Организация);
	ИзменениеВалютыМодуль();
	
	// Заполняет табличную часть "ОсновныеСредства"
	ВыбранноеЗначение = ВыполнитьПодборОС();
	ЗаполнитьТчОсновныеСредстваПоДаннымПодбора(ВыбранноеЗначение);	

КонецПроцедуры // ЗаполнитьДокумент()

// Процедура формирует структуру шапки документа и дополнительных полей.
// 
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, Отказ) Экспорт

	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Получим список ОС документа.
	СписокОС = ОсновныеСредства.ВыгрузитьКолонку("ОсновноеСредство");
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(СписокОС, Истина);
	
	СтруктураШапкиДокумента.Вставить("СписокОС", СписокОС);
	
	// Получим Вид класса ОС документа.
	Если ВидОперации = Перечисления.бит_му_ВидыОперацийНачислениеАмортизацииОС.ОсновныеСредства Тогда
		ВидКласса = Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства;
	Иначе
		ВидКласса = Перечисления.бит_му_ВидыКлассовОС.ИнвестиционнаяСобственность;
	КонецЕсли;
	
	СтруктураШапкиДокумента.Вставить("ВидКласса", ВидКласса);
	
КонецПроцедуры

// Функция готовит таблицы документа для проведения.
// 
// Возвращаемое значение:
//   ТаблицаБДДС   - ТаблицаЗначений.
// 
Функция ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента)  Экспорт
	
	// Движения по регистру бухгалтерии бит_Дополнительный_2.
	Запрос = Новый Запрос;
	
    Запрос.УстановитьПараметр("Ссылка",Ссылка);	
	Запрос.УстановитьПараметр("ПараметрКласс",
		ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.Класс_ОС);
	Запрос.УстановитьПараметр("ПараметрНачислятьАмортизацию",
		ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.НачислятьАмортизацию_ОС);
	Запрос.УстановитьПараметр("ПараметрНачислятьАмортизациюСТекущегоПериода",
		ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.НачислятьАмортизациюСТекущегоПериода_ОС); 
	Запрос.УстановитьПараметр("ПараметрЦФО",
		ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.ЦФО_ОС);
	Запрос.УстановитьПараметр("МоментВремени"   ,КонецМесяца(СтруктураШапкиДокумента.Дата));
	Запрос.УстановитьПараметр("Организация"     ,Организация);
	Запрос.УстановитьПараметр("СостояниеПринято",Перечисления.бит_му_СостоянияОС.ПринятоКУчету);
	
	//++ ЕРП
	ИмяСправочникаОсновныеСредства = бит_ОбщегоНазначения.ПолучитьИмяСправочникаОсновныеСредства();
	//-- ЕРП
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыОС.ОсновноеСредство,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПараметрыОС.Параметр = &ПараметрНачислятьАмортизацию
	|				ТОГДА ПараметрыОС.ЗначениеПараметра
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК НачислятьАмортизацию,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПараметрыОС.Параметр = &ПараметрНачислятьАмортизациюСТекущегоПериода
	|				ТОГДА ПараметрыОС.ЗначениеПараметра
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК НачислятьАмортизациюСТекущегоПериода,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПараметрыОС.Параметр = &ПараметрКласс
	|				ТОГДА ПараметрыОС.ЗначениеПараметра.ВидКласса
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК ВидКласса,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПараметрыОС.Параметр = &ПараметрЦФО
	|				ТОГДА ПараметрыОС.ЗначениеПараметра
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК ЦФО
	|ПОМЕСТИТЬ ТаблицаПараметров
	|ИЗ
	|	РегистрСведений.бит_му_ПараметрыОС.СрезПоследних(
	|			&МоментВремени,
	|			ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						бит_му_НачислениеАмортизацииОСОсновныеСредства.ОсновноеСредство
	|					ИЗ
	|						Документ.бит_му_НачислениеАмортизацииОС.ОсновныеСредства КАК бит_му_НачислениеАмортизацииОСОсновныеСредства
	|					ГДЕ
	|						бит_му_НачислениеАмортизацииОСОсновныеСредства.Ссылка = &Ссылка)
	|				И Организация = &Организация) КАК ПараметрыОС
	|
	|СГРУППИРОВАТЬ ПО
	|	ПараметрыОС.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_му_НачислениеАмортизацииОСОсновныеСредства.НомерСтроки,
	|	бит_му_НачислениеАмортизацииОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	бит_му_НачислениеАмортизацииОСОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	бит_му_НачислениеАмортизацииОСОсновныеСредства.ПервоначальнаяСтоимость - бит_му_НачислениеАмортизацииОСОсновныеСредства.НачисленнаяАмортизация - бит_му_НачислениеАмортизацииОСОсновныеСредства.СуммаОбесценения - бит_му_НачислениеАмортизацииОСОсновныеСредства.ЛиквидационнаяСтоимость - бит_му_НачислениеАмортизацииОСОсновныеСредства.СуммаАмортизации КАК БалансоваяСтоимостьПосле,
	|	бит_му_НачислениеАмортизацииОСОсновныеСредства.СпособОтраженияРасходовПоАмортизации,
    |	бит_му_НачислениеАмортизацииОСОсновныеСредства.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|	бит_му_СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат,
	|	бит_му_СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто1,
	|	бит_му_СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто2,
	|	бит_му_СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто3,
	|	бит_му_СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто4,
	|	ЕСТЬNULL(бит_му_СпособыОтраженияРасходовПоАмортизацииСпособы.Коэффициент, 0) КАК Коэффициент,
	|	бит_му_НачислениеАмортизацииОСОсновныеСредства.СчетНачисленияАмортизации,
	//++ ЕРП
	//|	ЕСТЬNULL(ПараметрИнвНомер.ИнвентарныйНомер, """") КАК ИнвентарныйНомер,
	|	ЕСТЬNULL(ОсновныеСредства.ИнвентарныйНомер, """") КАК ИнвентарныйНомер,
	//-- ЕРП
	|	ТаблицаПараметров.ВидКласса КАК ВидКласса,
	|	ЕСТЬNULL(ТаблицаПараметров.НачислятьАмортизацию, ЛОЖЬ) КАК НачислятьАмортизацию,
	|	ЕСТЬNULL(ТаблицаПараметров.НачислятьАмортизациюСТекущегоПериода, ЛОЖЬ) КАК НачислятьАмортизациюСТекущегоПериода,
	|	ЕСТЬNULL(СостоянияОС.ДатаСостояния, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПринятияКУчету,
	|	ТаблицаПараметров.ЦФО КАК ЦФО
	|ИЗ
	|	Документ.бит_му_НачислениеАмортизацииОС.ОсновныеСредства КАК бит_му_НачислениеАмортизацииОСОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_му_СпособыОтраженияРасходовПоАмортизации.Способы КАК бит_му_СпособыОтраженияРасходовПоАмортизацииСпособы
	|		ПО бит_му_НачислениеАмортизацииОСОсновныеСредства.СпособОтраженияРасходовПоАмортизации = бит_му_СпособыОтраженияРасходовПоАмортизацииСпособы.Ссылка
	//++ ЕРП
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
	//|				&МоментВремени,
	//|				ОсновноеСредство В
	//|						(ВЫБРАТЬ
	//|							бит_му_НачислениеАмортизацииОСОсновныеСредства.ОсновноеСредство
	//|						ИЗ
	//|							Документ.бит_му_НачислениеАмортизацииОС.ОсновныеСредства КАК бит_му_НачислениеАмортизацииОСОсновныеСредства
	//|						ГДЕ
	//|							бит_му_НачислениеАмортизацииОСОсновныеСредства.Ссылка = &Ссылка)
	//|					И Организация = &Организация) КАК ПараметрИнвНомер
	//|		ПО бит_му_НачислениеАмортизацииОСОсновныеСредства.ОсновноеСредство = ПараметрИнвНомер.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник." + ИмяСправочникаОсновныеСредства + " КАК ОсновныеСредства
	|			ПО бит_му_НачислениеАмортизацииОСОсновныеСредства.ОсновноеСредство = ОсновныеСредства.Ссылка
	//-- ЕРП
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПараметров КАК ТаблицаПараметров
	|		ПО бит_му_НачислениеАмортизацииОСОсновныеСредства.ОсновноеСредство = ТаблицаПараметров.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_му_СостоянияОС КАК СостоянияОС
	|		ПО бит_му_НачислениеАмортизацииОСОсновныеСредства.ОсновноеСредство = СостоянияОС.ОсновноеСредство
	|			И (СостоянияОС.Организация = &Организация)
	|			И (СостоянияОС.Состояние = &СостояниеПринято)
	|ГДЕ
	|	бит_му_НачислениеАмортизацииОСОсновныеСредства.Ссылка = &Ссылка
	|ИТОГИ
	|	МАКСИМУМ(СуммаАмортизации),
	|    СУММА(Коэффициент)
	|ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаПараметров";
	
	Результат = Запрос.Выполнить();
	
	
	СтруктураТаблиц = Новый Структура;

	СтруктураТаблиц.Вставить("ОС", Результат);
	
	Возврат СтруктураТаблиц;
	
КонецФункции // ПодготовитьТаблицуБДДС()

// Функция подготавливает таблицу дат принятия ОС.
// 
// Параметры:
//  МассивОС - Массив
// 
// Возвращаемое значение:
//  ТаблицаЗначения
// 
Функция ПодготовитьТаблицуДатПринятияОС(МассивОС) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СостояниеПринято", Перечисления.бит_му_СостоянияОС.ПринятоКУчету);
	Запрос.УстановитьПараметр("МассивОС", МассивОС);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_му_СостоянияОС.ОсновноеСредство,
	|	бит_му_СостоянияОС.ДатаСостояния КАК Период
	|ИЗ
	|	РегистрСведений.бит_му_СостоянияОС КАК бит_му_СостоянияОС
	|ГДЕ
	|	бит_му_СостоянияОС.ОсновноеСредство В(&МассивОС)
	|	И бит_му_СостоянияОС.Состояние = &СостояниеПринято
	|	И бит_му_СостоянияОС.Организация = &Организация";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция формирует массив недоступных параметров ОС в зависимости от
// от метода начисления амортизации.
// 
// Параметры:
//  ТекущаяСтрока - СтрокаТабличнойЧасти.ОсновныеСредства.
// 
// Возвращаемое значение:
//  Массив;
// 
Функция СформироватьМассивНедоступныхПараметров(ТекущаяСтрока)
	
	МассивНедоступныхПараметров = Новый Массив;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат МассивНедоступныхПараметров;
	КонецЕсли;
	
	МенеджерПеречисления	   = Перечисления.бит_му_МетодыНачисленияАмортизации;
	МетодНачисленияАмортизации = ТекущаяСтрока.МетодНачисленияАмортизации;
	
	Если МетодНачисленияАмортизации = МенеджерПеречисления.Линейный
		Или МетодНачисленияАмортизации = МенеджерПеречисления.УменьшаемогоОстатка Тогда
		
		МассивНедоступныхПараметров.Добавить("ПредполагаемыйОбъемПродукции");
		
	КонецЕсли;
	
	Возврат МассивНедоступныхПараметров;
	
КонецФункции // СформироватьМассивНедоступныхПараметров()

Процедура ЗаполнитьШапкуДокумента(ОбъектКопирования = Неопределено)
	
	НовыйВидОперации = ВидОперации;
	
	// Заполним шапку документа значениями по умолчанию.
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), ОбъектКопирования);

	Если НЕ ЗначениеЗаполнено(Дата) Тогда		
		Дата = КонецМесяца(ТекущаяДатаСеанса());		
	Иначе		
		Дата = КонецМесяца(Дата);		
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(НовыйВидОперации) Тогда
		// Если этого не сделать, то при создании нового система не предложит выбрать вид операции.
		ВидОперации = НовыйВидОперации;
	КонецЕсли;
	
	ВалютаДокумента = бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(Организация);
	
	СтруктураКурса = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	
	КурсДокумента = СтруктураКурса.Курс;
	КратностьДокумента = СтруктураКурса.Кратность;
	
КонецПроцедуры // ЗаполнитьШапкуДокумента()

// Функция выполняет подбор ОС через обработку подбора
//
Функция ВыполнитьПодборОС()
	
	ПараметрыПодбора  = ЗаполнитьПараметрыПодбора();
	ОбработкаПодбора = Обработки.бит_му_ПодборВНА.Создать();
	ВыбранноеЗначение = ОбработкаПодбора.ВыполнитьПодборДляЗакрытия(ПараметрыПодбора);
	
	Возврат ВыбранноеЗначение;
	
КонецФункции // ВыполнитьПодборОС()

//  Осуществляет поиск задвоенных начислений амортизации ОС в текущем периоде.
// 
Процедура НайтиЗадвоенныеНачисления(Отказ,Заголовок)
	
	Запрос=новый Запрос;
	запрос.УстановитьПараметр("ДатаНачала"   ,НачалоМесяца(Дата));
	запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(Дата));
	запрос.УстановитьПараметр("Ссылка"       ,Ссылка);
	
	//++ ЕРП
	ИмяСправочникаОсновныеСредства = бит_ОбщегоНазначения.ПолучитьИмяСправочникаОсновныеСредства();
	//-- ЕРП
	
	Запрос.Текст="ВЫБРАТЬ
	             |	ТекДокумент.ОсновноеСредство,
	             |	ТекДокумент.Ссылка,
				 //++ ЕРП
				 //|	ЕСТЬNULL(ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ИнвентарныйНомер, """") КАК ИнвентарныйНомер
				 |	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер
				 //-- ЕРП
	             |ИЗ
	             |	Документ.бит_му_НачислениеАмортизацииОС.ОсновныеСредства КАК ТекДокумент
				 //++ ЕРП
				 //|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
				 //|				&ДатаОкончания,
				 //|				ОсновноеСредство В
				 //|					(ВЫБРАТЬ
				 //|						бит_му_НачислениеАмортизацииОСОсновныеСредства.ОсновноеСредство
				 //|					ИЗ
				 //|						Документ.бит_му_НачислениеАмортизацииОС.ОсновныеСредства КАК бит_му_НачислениеАмортизацииОСОсновныеСредства
				 //|					ГДЕ
				 //|						бит_му_НачислениеАмортизацииОСОсновныеСредства.Ссылка = &Ссылка)) КАК ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних
				 //|		ПО ТекДокумент.ОсновноеСредство = ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник." + ИмяСправочникаОсновныеСредства + " КАК ОсновныеСредства
	             |				ПО ОсновныеСредства.Ссылка = ТекДокумент.ОсновноеСредство
	             //-- ЕРП
				 |ГДЕ
	             |	ТекДокумент.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	             |	И ТекДокумент.Ссылка.Проведен
	             |	И ТекДокумент.Ссылка.Ссылка <> &Ссылка
	             |	И ТекДокумент.ОсновноеСредство В
	             |			(ВЫБРАТЬ
	             |				ТекДокумент.ОсновноеСредство
	             |			ИЗ
	             |				Документ.бит_му_НачислениеАмортизацииОС.ОсновныеСредства КАК ТекДокумент
	             |			ГДЕ
	             |				ТекДокумент.Ссылка = &Ссылка)";
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ОсновноеСредство) Тогда
			ТекстСообщения = НСтр("ru = 'По основному средству инв. №%1 ""%2"" было проведено начисление амортизации за период: %3. Повторное начисление амортизации невозможно.'; 
			                      |en = 'By fixed assets inv. №%1 ""%2"" depreciation was calculated for the period: %3. Repeated depreciation is not possible.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.ИнвентарныйНомер, Выборка.ОсновноеСредство, Формат(Дата, "ДФ=MMMM-YYYY"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры // бит_НайтиЗадвоенныеНачисления()

// Процедура проверяет правильность заполнения строк таблиц документа.
// 
// Параметры: 
//  СтруктураТаблиц			- Структура, таблицы значений, содержащая данные для проведения и проверки.
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа.
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
// 
Процедура ПроверитьЗаполнениеТаблицДокумента(СтруктураТаблиц, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.бит_му_ВидыОперацийНачислениеАмортизацииОС.ОсновныеСредства Тогда
		ТекущийВидКласса = Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства;
	ИначеЕсли СтруктураШапкиДокумента.ВидОперации = Перечисления.бит_му_ВидыОперацийНачислениеАмортизацииОС.ИнвестиционнаяСобственность Тогда	
		ТекущийВидКласса = Перечисления.бит_му_ВидыКлассовОС.ИнвестиционнаяСобственность;
	КонецЕсли; 
	
	ВыборкаОС = СтруктураТаблиц.ОС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОС.Следующий() Цикл
		
		ВыборкаДетали = ВыборкаОС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДетали.Следующий() Цикл
			
			// Проверки
			Если ТекущийВидКласса <> ВыборкаДетали.ВидКласса Тогда
				
				ТекстСообщения = НСтр("ru = 'В строке №%1 табличной части ""Основные средства"" вид класса ""%2"" основного средства инв. №%3 ""%4"" не соответствует виду операции.'; 
				                      |en = 'In line №%1 of the fixed assets tabular part, class type %2 of fixed assets inv. The №%3 ""%4"" does not match the type of operation.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ВыборкаДетали.НомерСтроки, ВыборкаДетали.ВидКласса, 
										   ВыборкаДетали.ИнвентарныйНомер, ВыборкаДетали.ОсновноеСредство);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
			КонецЕсли; 
			
			
			Если НЕ ВыборкаДетали.НачислятьАмортизацию Тогда
				
				ТекстСообщения = НСтр("ru = 'По основному средству инв. №%1 ""%2"" амортизация не начисляется.'; 
				                      |en = 'By fixed assets inv. №%1 ""%2"" depreciation is not charged.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ВыборкаДетали.ИнвентарныйНомер, ВыборкаДетали.ОсновноеСредство);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
			КонецЕсли; 
			
			
			Если ВыборкаДетали.НачислятьАмортизацию 
				И НЕ ВыборкаДетали.НачислятьАмортизациюСТекущегоПериода
				И КонецМесяца(ВыборкаДетали.ДатаПринятияКУчету) = КонецМесяца(СтруктураШапкиДокумента.Дата)  Тогда
				
				ТекстСообщения = НСтр("ru = 'По основному средству инв. №%1 ""%2"" за период %3 амортизация не начисляется.'; 
				                      |en = 'By fixed assets inv. №%1 ""%2"" for the period %3 depreciation is not charged.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ВыборкаДетали.ИнвентарныйНомер, ВыборкаДетали.ОсновноеСредство,
										   Формат(СтруктураШапкиДокумента.Дата,"ДФ=MMMM-YYYY"));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
			КонецЕсли; 
			
			
			// В остальных записях группировки ОС тот же - достаточно проверить первую запись группировки.
			Прервать;
			
		КонецЦикла; // По детальным записям
		
	КонецЦикла; // По ОС
	
КонецПроцедуры // ПроверитьЗаполнениеТаблицДокумента()

// Процедура выполняет движения по регистрам.
//                
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента,СтруктураТаблиц,ИсторическиеКурсы, Отказ, Заголовок)
	
	// Движения по регистру бухгалтерии бит_Дополнительный_2.
	ВыборкаОС = СтруктураТаблиц.ОС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОС.Следующий() Цикл
	
		ВыборкаДетали = ВыборкаОС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		СуммаАмортизацииОбщая = ВыборкаОС.СуммаАмортизации;
		КоэффициентОбщий	  = ВыборкаОС.Коэффициент;
		СуммаАмортизацииНачисленная     = 0;
		СуммаАмортизацииНачисленнаяРегл = 0;
		СуммаАмортизацииНачисленнаяУпр  = 0;
		
		ИндексРаспределения = 1;
		ФлагСброшен = Ложь;		
		КоличествоДетали = ВыборкаДетали.Количество();
		Пока ВыборкаДетали.Следующий() Цикл
			
			КурсыВалютМУ       = ИсторическиеКурсы[ВыборкаДетали.ОсновноеСредство].МУ;
			КурсыВалютУпр      = ИсторическиеКурсы[ВыборкаДетали.ОсновноеСредство].Упр;
			КурсыВалютРегл     = ИсторическиеКурсы[ВыборкаДетали.ОсновноеСредство].Регл;
			КурсыВалютДокумент = ИсторическиеКурсы[ВыборкаДетали.ОсновноеСредство].Документ;
			
			// Распределяем согласно коэффициентам способа отражения расходов.
			КоэффицентРаспредления = ВыборкаДетали.Коэффициент;
			
			СуммаАмортизации = Окр(СуммаАмортизацииОбщая * КоэффицентРаспредления / КоэффициентОбщий, 2, 1);
			СуммаАмортизацииНачисленная = СуммаАмортизацииНачисленная + СуммаАмортизации;
			
			// Убираем ошибки округления
			Если ИндексРаспределения = КоличествоДетали Тогда			  
				СуммаАмортизации = СуммаАмортизации + СуммаАмортизацииОбщая - СуммаАмортизацииНачисленная; 			  
			КонецЕсли; 
			
			СуммаАмортизацииМУ = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СуммаАмортизации,
				КурсыВалютДокумент, КурсыВалютМУ);
			
			Если ВыборкаДетали.БалансоваяСтоимостьПосле = 0 Тогда
				СтруктураСуммы = Документы.бит_му_НачислениеАмортизацииОС.ВычислитьСуммыАмортизации(
				СтруктураШапкиДокумента.Организация, ВыборкаДетали.ОсновноеСредство, МоментВремени());
				
				// списание суммы регл.	
				ЛиквидационнаяСтоимостьРегл = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ВыборкаДетали.ЛиквидационнаяСтоимость,
					КурсыВалютДокумент, КурсыВалютРегл);
				
				СуммаАмортизацииРеглОбщая = СтруктураСуммы.СуммаРегл - ЛиквидационнаяСтоимостьРегл;
				Если ИндексРаспределения = КоличествоДетали Тогда
					СуммаАмортизацииРегл = СуммаАмортизацииРеглОбщая - СуммаАмортизацииНачисленнаяРегл; 
				Иначе
					СуммаАмортизацииРегл = Окр(СуммаАмортизацииРеглОбщая * КоэффицентРаспредления / КоэффициентОбщий, 2, 1);
					СуммаАмортизацииНачисленнаяРегл = СуммаАмортизацииНачисленнаяРегл + СуммаАмортизацииРегл;
				КонецЕсли; 
				
				// списание суммы упр.
				ЛиквидационнаяСтоимостьУпр = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ВыборкаДетали.ЛиквидационнаяСтоимость,
					КурсыВалютДокумент, КурсыВалютУпр);
				
				СуммаАмортизацииУпрОбщая = СтруктураСуммы.СуммаУпр - ЛиквидационнаяСтоимостьУпр;
				Если ИндексРаспределения = КоличествоДетали Тогда
					СуммаАмортизацииУпр = СуммаАмортизацииУпрОбщая - СуммаАмортизацииНачисленнаяУпр; 
				Иначе
					СуммаАмортизацииУпр = Окр(СуммаАмортизацииУпрОбщая * КоэффицентРаспредления / КоэффициентОбщий, 2, 1);
					СуммаАмортизацииНачисленнаяУпр = СуммаАмортизацииНачисленнаяУпр + СуммаАмортизацииУпр;
				КонецЕсли;
				
			Иначе
				СуммаАмортизацииРегл = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СуммаАмортизацииМУ,
					КурсыВалютМУ, КурсыВалютРегл);
				
				СуммаАмортизацииУпр  = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СуммаАмортизацииМУ,
					КурсыВалютМУ, КурсыВалютУпр);
			КонецЕсли;
			
			ИндексРаспределения = ИндексРаспределения+1;
			
			СтруктураСуммы = Новый Структура;
			СтруктураСуммы.Вставить("СуммаАмортизации", СуммаАмортизации);
			СтруктураСуммы.Вставить("СуммаМУ",          СуммаАмортизацииМУ);
			СтруктураСуммы.Вставить("СуммаРегл",        СуммаАмортизацииРегл);
			СтруктураСуммы.Вставить("СуммаУпр",         СуммаАмортизацииУпр);
			
			// Формируем движение по начислению амортизации
			// ДТ СчетЗатрат КТ СчетНачисленияАмортизации СуммаАмортизации.
			СоздатьЗаписьПоНачислениюАмортизации(СтруктураШапкиДокумента,ВыборкаДетали,СтруктураСуммы,КурсыВалютДокумент);
			
			// Если полностью самортизировали ОС - сбрасываем флаг НачислятьАмортизацию.
			Если НЕ ФлагСброшен 
				И ВыборкаДетали.БалансоваяСтоимостьПосле <=0 Тогда
				
				Запись = Движения.бит_му_ПараметрыОС.Добавить();
				Запись.Период      = СтруктураШапкиДокумента.Дата;
				Запись.Организация = СтруктураШапкиДокумента.Организация;
				Запись.ОсновноеСредство = ВыборкаДетали.ОсновноеСредство;
				Запись.Параметр         = ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.НачислятьАмортизацию_ОС;
				Запись.ЗначениеПараметра= Ложь;
				ФлагСброшен             = Истина;				  
				
			КонецЕсли; 
			  
		КонецЦикла; // По детальным записям
		
		// По регистру события ОС
		Запись = Движения.бит_му_СобытияОС.Добавить();
		Запись.Период           = СтруктураШапкиДокумента.Дата;
		Запись.Организация      = СтруктураШапкиДокумента.Организация;
		Запись.ОсновноеСредство = ВыборкаОС.ОсновноеСредство;
		Запись.Событие          = Перечисления.бит_му_СобытияОС.НачислениеАмортизации;
		
	КонецЦикла; // По ОС
	
КонецПроцедуры // ДвиженияПоРегистрам()

// Процедура формирует проводку по списанию амортизации ОС.
// 
// Параметры:
//  СтруктураШапкиДокумента  - Структура.
//  СтрокаТаблицы            - СтрокаТаблицыЗначений.
//  ВалютаМУ                 - СправочникСсылка.Валюты.
//  СтруктураКурсыВалют      - Структура.
//                
Процедура СоздатьЗаписьПоНачислениюАмортизации(СтруктураШапкиДокумента,СтрокаТаблицы,СтруктураСуммы,СтруктураКурсыВалют)

	Если СтруктураСуммы.СуммаМУ = 0 Тогда
		Возврат;
	КонецЕсли; 

	Запись = Движения.бит_Дополнительный_2.Добавить();
	
	СодержаниеПроводки = НСтр("ru='начислена амортизация';en='depreciation accrued'");
	
	// Заполнение атрибутов записи	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация", СтруктураШапкиДокумента.Организация);
	СтруктураПараметров.Вставить("Период",      СтруктураШапкиДокумента.Дата);
	СтруктураПараметров.Вставить("Валюта",      СтруктураКурсыВалют.Валюта);
	СтруктураПараметров.Вставить("СчетДт",      СтрокаТаблицы.СчетЗатрат);
	СтруктураПараметров.Вставить("СчетКт",      СтрокаТаблицы.СчетНачисленияАмортизации); 
	СтруктураПараметров.Вставить("Сумма",       СтруктураСуммы.СуммаАмортизации);
	СтруктураПараметров.Вставить("Содержание",  СодержаниеПроводки);
											   
	бит_му_ОбщегоНазначения.ЗаполнитьЗаписьРегистраМУ(Запись,СтруктураПараметров);											   
	
	// Заполнение аналитики	
	Для НомерСубконто = 1 По мКоличествоСубконтоМУ Цикл
		бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетДт,Запись.СубконтоДт,НомерСубконто,СтрокаТаблицы["Субконто"+НомерСубконто]);			
	КонецЦикла; 
	
	бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетКт,Запись.СубконтоКт,"ОсновныеСредства", СтрокаТаблицы.ОсновноеСредство);		
	бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетКт,Запись.СубконтоКт,"ЦФО", СтрокаТаблицы.ЦФО);
	
	ЗаполнитьЗначенияСвойств(Запись, СтруктураСуммы);
	
КонецПроцедуры // СоздатьЗаписьПоСписаниюАмортизации()

Функция ИсторическиеКурсыВалют(СтруктураШапкиДокумента, МассивОС, Период, СтруктураКурсыВалют)
	
	ИсторическиеКурсы = бит_му_ВНА.ИсторическиеКурсыВалют(СтруктураШапкиДокумента, МассивОС, Период, СтруктураКурсыВалют);	
	
	// Получим дату принятия к учету для каждого ОС.
	ТаблицаДатПринятияОС = ПодготовитьТаблицуДатПринятияОС(МассивОС);
	
	ТаблицаПериодов = ТаблицаДатПринятияОС.Скопировать();
	ТаблицаПериодов.Свернуть("Период");
	СтруктураКурсыВалютДокумент = Новый Структура;
	СтруктураКурсыВалютДокумент.Вставить("Документ", СтруктураКурсыВалют.Документ); 
	
	// Получим курсы валюты документа для каждого ОС на дату принятия к учету.
	Курсы = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(ТаблицаПериодов, СтруктураКурсыВалютДокумент);

	СоответствиеКурсовИОС = Новый Соответствие;
	 
	Для каждого Строка Из ТаблицаДатПринятияОС Цикл
		СоответствиеКурсовИОС.Вставить(Строка.ОсновноеСредство, Курсы[Строка.Период])
	КонецЦикла; 
	
	Для Каждого ТекОС Из ИсторическиеКурсы Цикл
		ТекКурсы = СоответствиеКурсовИОС[ТекОС.Ключ];
		Если ТипЗнч(ТекКурсы) = Тип("Структура") И ТекКурсы.Свойство("Документ") Тогда
			
			ТекОС.Значение.Документ = ТекКурсы.Документ;
			
		КонецЕсли; 
	КонецЦикла;
	
	Возврат ИсторическиеКурсы;
	
КонецФункции

#КонецОбласти

#Область Инициализация

мКоличествоСубконтоМУ = 4;

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
